In [4]:
import pandas as pd
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},

          {'a': 100, 'b': 200, 'c': 300, 'd': 400},

          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

In [5]:
mydict

[{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

In [7]:
df = pd.DataFrame(mydict)

In [8]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [12]:
#df.iloc[0]
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [13]:
df.iloc[[2]]

      a     b     c     d
2  1000  2000  3000  4000

In [14]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [15]:
df.iloc[[0,2]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [16]:
df.iloc[[2,1]]

      a     b     c     d
2  1000  2000  3000  4000
1   100   200   300   400

In [18]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [19]:
df.iloc[0:]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [21]:
df.iloc[[False,False,True]]

      a     b     c     d
2  1000  2000  3000  4000

In [22]:
df.iloc[1,2]

300

In [24]:
df.iloc[[0,1],[0,2]]

     a    c
0    1    3
1  100  300

In [26]:
df.iloc[:2,2:]

     c    d
0    3    4
1  300  400

In [29]:
df.iloc[0:2,2:4]

     c    d
0    3    4
1  300  400